espressif/esp-idf/components/soc/esp32c6/register/soc/gpio_reg.h
/** GPIO_IN_REG register
 *  GPIO input register for GPIO0-31
 */
#define GPIO_IN_REG (DR_REG_GPIO_BASE + 0x3c)
/** GPIO_IN_DATA_NEXT : RO; bitpos: [31:0]; default: 0;
 *  GPIO input register for GPIO0-31
 */
#define GPIO_IN_DATA_NEXT    0xFFFFFFFFU
#define GPIO_IN_DATA_NEXT_M  (GPIO_IN_DATA_NEXT_V << GPIO_IN_DATA_NEXT_S)
#define GPIO_IN_DATA_NEXT_V  0xFFFFFFFFU
#define GPIO_IN_DATA_NEXT_S  0

/** GPIO_IN1_REG register
 *  GPIO input register for GPIO32-34
 */
#define GPIO_IN1_REG (DR_REG_GPIO_BASE + 0x40)
/** GPIO_IN1_DATA_NEXT : RO; bitpos: [2:0]; default: 0;
 *  GPIO input register for GPIO32-34
 */
#define GPIO_IN1_DATA_NEXT    0x00000007U
#define GPIO_IN1_DATA_NEXT_M  (GPIO_IN1_DATA_NEXT_V << GPIO_IN1_DATA_NEXT_S)
#define GPIO_IN1_DATA_NEXT_V  0x00000007U
#define GPIO_IN1_DATA_NEXT_S  0

/** GPIO_STATUS_REG register
 *  GPIO interrupt status register for GPIO0-31
 */
#define GPIO_STATUS_REG (DR_REG_GPIO_BASE + 0x44)
/** GPIO_STATUS_INTERRUPT : R/W/WTC; bitpos: [31:0]; default: 0;
 *  GPIO interrupt status register for GPIO0-31
 */
#define GPIO_STATUS_INTERRUPT    0xFFFFFFFFU
#define GPIO_STATUS_INTERRUPT_M  (GPIO_STATUS_INTERRUPT_V << GPIO_STATUS_INTERRUPT_S)
#define GPIO_STATUS_INTERRUPT_V  0xFFFFFFFFU
#define GPIO_STATUS_INTERRUPT_S  0

/** GPIO_STATUS_W1TS_REG register
 *  GPIO interrupt status set register for GPIO0-31
 */
#define GPIO_STATUS_W1TS_REG (DR_REG_GPIO_BASE + 0x48)
/** GPIO_STATUS_W1TS : WT; bitpos: [31:0]; default: 0;
 *  GPIO interrupt status set register for GPIO0-31
 */
#define GPIO_STATUS_W1TS    0xFFFFFFFFU
#define GPIO_STATUS_W1TS_M  (GPIO_STATUS_W1TS_V << GPIO_STATUS_W1TS_S)
#define GPIO_STATUS_W1TS_V  0xFFFFFFFFU
#define GPIO_STATUS_W1TS_S  0

/** GPIO_STATUS_W1TC_REG register
 *  GPIO interrupt status clear register for GPIO0-31
 */
#define GPIO_STATUS_W1TC_REG (DR_REG_GPIO_BASE + 0x4c)
/** GPIO_STATUS_W1TC : WT; bitpos: [31:0]; default: 0;
 *  GPIO interrupt status clear register for GPIO0-31
 */
#define GPIO_STATUS_W1TC    0xFFFFFFFFU
#define GPIO_STATUS_W1TC_M  (GPIO_STATUS_W1TC_V << GPIO_STATUS_W1TC_S)
#define GPIO_STATUS_W1TC_V  0xFFFFFFFFU
#define GPIO_STATUS_W1TC_S  0

/** GPIO_STATUS1_REG register
 *  GPIO interrupt status register for GPIO32-34
 */
#define GPIO_STATUS1_REG (DR_REG_GPIO_BASE + 0x50)
/** GPIO_STATUS1_INTERRUPT : R/W/WTC; bitpos: [2:0]; default: 0;
 *  GPIO interrupt status register for GPIO32-34
 */
#define GPIO_STATUS1_INTERRUPT    0x00000007U
#define GPIO_STATUS1_INTERRUPT_M  (GPIO_STATUS1_INTERRUPT_V << GPIO_STATUS1_INTERRUPT_S)
#define GPIO_STATUS1_INTERRUPT_V  0x00000007U
#define GPIO_STATUS1_INTERRUPT_S  0

/** GPIO_STATUS1_W1TS_REG register
 *  GPIO interrupt status set register for GPIO32-34
 */
#define GPIO_STATUS1_W1TS_REG (DR_REG_GPIO_BASE + 0x54)
/** GPIO_STATUS1_W1TS : WT; bitpos: [2:0]; default: 0;
 *  GPIO interrupt status set register for GPIO32-34
 */
#define GPIO_STATUS1_W1TS    0x00000007U
#define GPIO_STATUS1_W1TS_M  (GPIO_STATUS1_W1TS_V << GPIO_STATUS1_W1TS_S)
#define GPIO_STATUS1_W1TS_V  0x00000007U
#define GPIO_STATUS1_W1TS_S  0

/** GPIO_STATUS1_W1TC_REG register
 *  GPIO interrupt status clear register for GPIO32-34
 */
#define GPIO_STATUS1_W1TC_REG (DR_REG_GPIO_BASE + 0x58)
/** GPIO_STATUS1_W1TC : WT; bitpos: [2:0]; default: 0;
 *  GPIO interrupt status clear register for GPIO32-34
 */
#define GPIO_STATUS1_W1TC    0x00000007U
#define GPIO_STATUS1_W1TC_M  (GPIO_STATUS1_W1TC_V << GPIO_STATUS1_W1TC_S)
#define GPIO_STATUS1_W1TC_V  0x00000007U
#define GPIO_STATUS1_W1TC_S  0

/** GPIO_PCPU_INT_REG register
 *  GPIO PRO_CPU interrupt status register for GPIO0-31
 */
#define GPIO_PCPU_INT_REG (DR_REG_GPIO_BASE + 0x5c)
/** GPIO_PROCPU_INT : RO; bitpos: [31:0]; default: 0;
 *  GPIO PRO_CPU interrupt status register for GPIO0-31
 */
#define GPIO_PROCPU_INT    0xFFFFFFFFU
#define GPIO_PROCPU_INT_M  (GPIO_PROCPU_INT_V << GPIO_PROCPU_INT_S)
#define GPIO_PROCPU_INT_V  0xFFFFFFFFU
#define GPIO_PROCPU_INT_S  0

/** GPIO_PCPU_NMI_INT_REG register
 *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO0-31
 */
#define GPIO_PCPU_NMI_INT_REG (DR_REG_GPIO_BASE + 0x60)
/** GPIO_PROCPU_NMI_INT : RO; bitpos: [31:0]; default: 0;
 *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO0-31
 */
#define GPIO_PROCPU_NMI_INT    0xFFFFFFFFU
#define GPIO_PROCPU_NMI_INT_M  (GPIO_PROCPU_NMI_INT_V << GPIO_PROCPU_NMI_INT_S)
#define GPIO_PROCPU_NMI_INT_V  0xFFFFFFFFU
#define GPIO_PROCPU_NMI_INT_S  0

/** GPIO_CPUSDIO_INT_REG register
 *  GPIO CPUSDIO interrupt status register for GPIO0-31
 */
#define GPIO_CPUSDIO_INT_REG (DR_REG_GPIO_BASE + 0x64)
/** GPIO_SDIO_INT : RO; bitpos: [31:0]; default: 0;
 *  GPIO CPUSDIO interrupt status register for GPIO0-31
 */
#define GPIO_SDIO_INT    0xFFFFFFFFU
#define GPIO_SDIO_INT_M  (GPIO_SDIO_INT_V << GPIO_SDIO_INT_S)
#define GPIO_SDIO_INT_V  0xFFFFFFFFU
#define GPIO_SDIO_INT_S  0

/** GPIO_PCPU_INT1_REG register
 *  GPIO PRO_CPU interrupt status register for GPIO32-34
 */
#define GPIO_PCPU_INT1_REG (DR_REG_GPIO_BASE + 0x68)
/** GPIO_PROCPU_INT1 : RO; bitpos: [2:0]; default: 0;
 *  GPIO PRO_CPU interrupt status register for GPIO32-34
 */
#define GPIO_PROCPU_INT1    0x00000007U
#define GPIO_PROCPU_INT1_M  (GPIO_PROCPU_INT1_V << GPIO_PROCPU_INT1_S)
#define GPIO_PROCPU_INT1_V  0x00000007U
#define GPIO_PROCPU_INT1_S  0

/** GPIO_PCPU_NMI_INT1_REG register
 *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO32-34
 */
#define GPIO_PCPU_NMI_INT1_REG (DR_REG_GPIO_BASE + 0x6c)
/** GPIO_PROCPU_NMI_INT1 : RO; bitpos: [2:0]; default: 0;
 *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO32-34
 */
#define GPIO_PROCPU_NMI_INT1    0x00000007U
#define GPIO_PROCPU_NMI_INT1_M  (GPIO_PROCPU_NMI_INT1_V << GPIO_PROCPU_NMI_INT1_S)
#define GPIO_PROCPU_NMI_INT1_V  0x00000007U
#define GPIO_PROCPU_NMI_INT1_S  0

/** GPIO_CPUSDIO_INT1_REG register
 *  GPIO CPUSDIO interrupt status register for GPIO32-34
 */
#define GPIO_CPUSDIO_INT1_REG (DR_REG_GPIO_BASE + 0x70)
/** GPIO_SDIO_INT1 : RO; bitpos: [2:0]; default: 0;
 *  GPIO CPUSDIO interrupt status register for GPIO32-34
 */
#define GPIO_SDIO_INT1    0x00000007U
#define GPIO_SDIO_INT1_M  (GPIO_SDIO_INT1_V << GPIO_SDIO_INT1_S)
#define GPIO_SDIO_INT1_V  0x00000007U
#define GPIO_SDIO_INT1_S  0

/** GPIO_PIN0_REG register
 *  GPIO pin configuration register
 */
#define GPIO_PIN0_REG (DR_REG_GPIO_BASE + 0x74)
/** GPIO_PIN0_SYNC2_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  set GPIO input_sync2 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
 *  posedge.
 */
#define GPIO_PIN0_SYNC2_BYPASS    0x00000003U
#define GPIO_PIN0_SYNC2_BYPASS_M  (GPIO_PIN0_SYNC2_BYPASS_V << GPIO_PIN0_SYNC2_BYPASS_S)
#define GPIO_PIN0_SYNC2_BYPASS_V  0x00000003U
#define GPIO_PIN0_SYNC2_BYPASS_S  0
/** GPIO_PIN0_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  set this bit to select pad driver. 1:open-drain. 0:normal.
 */
#define GPIO_PIN0_PAD_DRIVER    (BIT(2))
#define GPIO_PIN0_PAD_DRIVER_M  (GPIO_PIN0_PAD_DRIVER_V << GPIO_PIN0_PAD_DRIVER_S)
#define GPIO_PIN0_PAD_DRIVER_V  0x00000001U
#define GPIO_PIN0_PAD_DRIVER_S  2
/** GPIO_PIN0_SYNC1_BYPASS : R/W; bitpos: [4:3]; default: 0;
 *  set GPIO input_sync1 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
 *  posedge.
 */
#define GPIO_PIN0_SYNC1_BYPASS    0x00000003U
#define GPIO_PIN0_SYNC1_BYPASS_M  (GPIO_PIN0_SYNC1_BYPASS_V << GPIO_PIN0_SYNC1_BYPASS_S)
#define GPIO_PIN0_SYNC1_BYPASS_V  0x00000003U
#define GPIO_PIN0_SYNC1_BYPASS_S  3
/** GPIO_PIN0_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  set this value to choose interrupt mode. 0:disable GPIO interrupt. 1:trigger at
 *  posedge. 2:trigger at negedge. 3:trigger at any edge. 4:valid at low level. 5:valid
 *  at high level
 */
#define GPIO_PIN0_INT_TYPE    0x00000007U
#define GPIO_PIN0_INT_TYPE_M  (GPIO_PIN0_INT_TYPE_V << GPIO_PIN0_INT_TYPE_S)
#define GPIO_PIN0_INT_TYPE_V  0x00000007U
#define GPIO_PIN0_INT_TYPE_S  7
/** GPIO_PIN0_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  set this bit to enable GPIO wakeup.(can only wakeup CPU from Light-sleep Mode)
 */
#define GPIO_PIN0_WAKEUP_ENABLE    (BIT(10))
#define GPIO_PIN0_WAKEUP_ENABLE_M  (GPIO_PIN0_WAKEUP_ENABLE_V << GPIO_PIN0_WAKEUP_ENABLE_S)
#define GPIO_PIN0_WAKEUP_ENABLE_V  0x00000001U
#define GPIO_PIN0_WAKEUP_ENABLE_S  10
/** GPIO_PIN0_CONFIG : R/W; bitpos: [12:11]; default: 0;
 *  reserved
 */
#define GPIO_PIN0_CONFIG    0x00000003U
#define GPIO_PIN0_CONFIG_M  (GPIO_PIN0_CONFIG_V << GPIO_PIN0_CONFIG_S)
#define GPIO_PIN0_CONFIG_V  0x00000003U
#define GPIO_PIN0_CONFIG_S  11
/** GPIO_PIN0_INT_ENA : R/W; bitpos: [17:13]; default: 0;
 *  set bit 13 to enable CPU interrupt. set bit 14 to enable CPU(not shielded)
 *  interrupt.
 */
#define GPIO_PIN0_INT_ENA    0x0000001FU
#define GPIO_PIN0_INT_ENA_M  (GPIO_PIN0_INT_ENA_V << GPIO_PIN0_INT_ENA_S)
#define GPIO_PIN0_INT_ENA_V  0x0000001FU
#define GPIO_PIN0_INT_ENA_S  13

